app/Controllers/login.php

	public function index()
	{
		$userModel = new UsuarioModel();
		$data = json_decode(file_get_contents('php://input'));

		if (is_null($data)) {
			echo msg("error", "Usuário ou tipo estão vazios");
			return;
		}

		$user = $userModel->where('nome', $data->nome)->first();
---
SELECT *
FROM `Usuario`
WHERE `nome` = 'tiago.roberto'
 LIMIT 1